# QVC Challenge Python Verison(Convertion from R)

In [2]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

In [83]:
customer = pd.read_csv('Data/Customer master.csv')
customer.head()

   CUSTOMER_NBR STATE ZIP_CODE  SHOPPER_SEGMENT_CODE
0        405680    OR    97331                   NaN
1        634748    IL    60126                     1
2        693545    MI    48170                     1
3        473617    DE    19720                     1
4        620023    TN    38018                   NaN

In [84]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65535 entries, 0 to 65534
Data columns (total 4 columns):
CUSTOMER_NBR            65535 non-null int64
STATE                   65535 non-null object
ZIP_CODE                65535 non-null object
SHOPPER_SEGMENT_CODE    49331 non-null float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.5+ MB

## customer handing 
 - SEGEMENT NAN -> 0

In [85]:
customer.SHOPPER_SEGMENT_CODE = customer.SHOPPER_SEGMENT_CODE.fillna(0)

In [86]:
customer.head()

   CUSTOMER_NBR STATE ZIP_CODE  SHOPPER_SEGMENT_CODE
0        405680    OR    97331                     0
1        634748    IL    60126                     1
2        693545    MI    48170                     1
3        473617    DE    19720                     1
4        620023    TN    38018                     0

### Zip

In [87]:
zips = pd.read_csv('Data/zipcode.csv')

In [88]:
zips.head()

   zip        city state   latitude  longitude  timezone  dst
0  210  Portsmouth    NH  43.005895 -71.013202        -5    1
1  211  Portsmouth    NH  43.005895 -71.013202        -5    1
2  212  Portsmouth    NH  43.005895 -71.013202        -5    1
3  213  Portsmouth    NH  43.005895 -71.013202        -5    1
4  214  Portsmouth    NH  43.005895 -71.013202        -5    1

In [89]:
zips.ix[:,[0,1,3,4]].head()

   zip        city   latitude  longitude
0  210  Portsmouth  43.005895 -71.013202
1  211  Portsmouth  43.005895 -71.013202
2  212  Portsmouth  43.005895 -71.013202
3  213  Portsmouth  43.005895 -71.013202
4  214  Portsmouth  43.005895 -71.013202

In [90]:
zips = zips.ix[:,[0,1,3,4]]

In [91]:
zips[zips.zip==97331]

         zip       city   latitude  longitude
41881  97331  Corvallis  44.565648 -123.27906

In [92]:
zips = zips.rename(columns={'zip':'ZIP_CODE'})

In [93]:
zips.head()

   ZIP_CODE        city   latitude  longitude
0       210  Portsmouth  43.005895 -71.013202
1       211  Portsmouth  43.005895 -71.013202
2       212  Portsmouth  43.005895 -71.013202
3       213  Portsmouth  43.005895 -71.013202
4       214  Portsmouth  43.005895 -71.013202

In [114]:
customer['ZIP_CODE'] = pd.to_numeric(customer.ZIP_CODE,errors='ignore')

In [117]:
customer[customer.ZIP_CODE=='60126']

       CUSTOMER_NBR STATE ZIP_CODE  SHOPPER_SEGMENT_CODE
1            634748    IL    60126                     1
1159         325907    IL    60126                     4
2078         458556    IL    60126                     5
5192         171793    IL    60126                     1
19871        440310    IL    60126                     4
47321        649636    IL    60126                     3
60029        635122    IL    60126                     2

In [70]:
zips[zips.ZIP_CODE==60126]

      ZIP_CODE      city  latitude  longitude
26842    60126  Elmhurst  41.89103  -87.94181

 - String 형으로 되어있엇다. 그래서 MERGE가 안됐다.
 - MERGE를 할때 Type이 중요하다.

In [118]:
zips.ZIP_CODE = zips.ZIP_CODE.astype(str)

In [119]:
pd.merge(customer,zips).head()

,CUSTOMER_NBR,STATE,ZIP_CODE,SHOPPER_SEGMENT_CODE,city,latitude,longitude
0,405680,OR,97331,0,Corvallis,44.565648,-123.27906
1,634748,IL,60126,1,Elmhurst,41.891030,-87.94181
2,325907,IL,60126,4,Elmhurst,41.891030,-87.94181
3,458556,IL,60126,5,Elmhurst,41.891030,-87.94181
4,171793,IL,60126,1,Elmhurst,41.891030,-87.94181

In [120]:
customer = pd.merge(customer,zips)

### TimeZone

In [169]:
timezone = pd.read_csv("Data/timezone.csv")

In [170]:
timezone.head()

           city state timezone
0          Avon    CT      EST
1        Baltic    CT      EST
2  Beacon Falls    CT      EST
3    Bridgeport    CT      EST
4    Canterbury    CT      EST

In [171]:
timezone.state.unique()

array(['CT', 'DE', 'FL', 'GA', 'IN', 'KY', 'ME', 'MD', 'MA', 'MI', 'NH',
       'NJ', 'NY', 'NC', 'OH', 'PA', 'RI', 'SC', 'TN', 'VT', 'VA', 'WV',
       'AL', 'AR', 'IL', 'IA', 'KS', 'LA', 'MN', 'MS', 'MO', 'NE', 'ND',
       'OK', 'SD', 'TX', 'WI', 'AZ', 'CO', 'ID', 'MT', 'NM', 'UT', 'WY',
       'CA', 'NV', 'OR', 'WA', 'AK', 'HI'], dtype=object)

In [172]:
timezone = timezone.drop_duplicates(['state'],keep='first')

In [173]:
timezone = timezone.ix[:,(1,2)]

In [174]:
timezone.head() # Timezone중복제거.

    state timezone
0      CT      EST
53     DE      EST
144    FL      EST
345    GA      EST
576    IN      EST

In [178]:
timezone = timezone.rename(columns={'state':'STATE'})

In [181]:
customer = pd.merge(customer,timezone,on='STATE')

In [182]:
customer.timezone.unique()

array(['PST', 'CST', 'EST', 'MST', 'US/Hawaii', 'US/Alaska'], dtype=object)

## OrderList Handling

In [202]:
orderlist = pd.read_csv("data/6 month history of customer orders.csv")

In [203]:
orderlist.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65535 entries, 0 to 65534
Data columns (total 6 columns):
ORDER_NBR         65535 non-null int64
ORDER_LINE_NBR    65535 non-null int64
CUSTOMER_NBR      65535 non-null int64
PRODUCT_ID        65535 non-null int64
ORDER_DATE        65535 non-null object
ORDER_TIME        65535 non-null object
dtypes: int64(4), object(2)
memory usage: 3.5+ MB

In [204]:
orderlist.ORDER_DATE = pd.to_datetime(orderlist.ORDER_DATE)

In [217]:
import datetime as dt

In [222]:
orderlist.ORDER_TIME = pd.to_datetime(orderlist.ORDER_TIME,format='%H:%M:%S').dt.time

In [223]:
orderlist.head()

   ORDER_NBR  ORDER_LINE_NBR  CUSTOMER_NBR  PRODUCT_ID ORDER_DATE ORDER_TIME
0          3               1        627088        8228 2012-10-01   03:40:06
1          4               1        419748       61616 2012-10-01   07:32:14
2         16               1        250358        3265 2012-10-01   14:16:30
3         17               2        250358        3523 2012-10-01   14:16:30
4         24               1        381935       56148 2012-10-01   14:50:34

In [220]:
orderlist.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65535 entries, 0 to 65534
Data columns (total 6 columns):
ORDER_NBR         65535 non-null int64
ORDER_LINE_NBR    65535 non-null int64
CUSTOMER_NBR      65535 non-null int64
PRODUCT_ID        65535 non-null int64
ORDER_DATE        65535 non-null datetime64[ns]
ORDER_TIME        65535 non-null object
dtypes: datetime64[ns](1), int64(4), object(1)
memory usage: 3.5+ MB

In [232]:
tmp = orderlist.ORDER_DATE.apply(lambda x:x.strftime('%Y-%m-%d')).head()

In [234]:
tmp2 = orderlist.ORDER_TIME.apply(lambda x:x.strftime('%H:%M:%S')).head()

In [247]:
def combine_date_time(df, datecol, timecol):
    return pd.to_datetime(df[datecol].dt.date.astype(str)
                          + ' '
                          + df[timecol].astype(str))

In [252]:
orderlist['ORDER_DATES'] = combine_date_time(orderlist,'ORDER_DATE','ORDER_TIME')

In [253]:
orderlist.head()

,ORDER_NBR,ORDER_LINE_NBR,CUSTOMER_NBR,PRODUCT_ID,ORDER_DATE,ORDER_TIME,ORDER_DATES
0,3,1,627088,8228,2012-10-01,03:40:06,2012-10-01 03:40:06
1,4,1,419748,61616,2012-10-01,07:32:14,2012-10-01 07:32:14
2,16,1,250358,3265,2012-10-01,14:16:30,2012-10-01 14:16:30
3,17,2,250358,3523,2012-10-01,14:16:30,2012-10-01 14:16:30
4,24,1,381935,56148,2012-10-01,14:50:34,2012-10-01 14:50:34

In [256]:
orderlist.ORDER_DATES = pd.to_datetime(orderlist.ORDER_DATES,format='%Y-%m-%d %H:%M:%S')

In [266]:
orderlist['YEAR'] = orderlist.ORDER_DATES.dt.year
orderlist['MONTH'] = orderlist.ORDER_DATES.dt.month
orderlist['DAY'] = orderlist.ORDER_DATES.dt.day
orderlist['HOUR'] = orderlist.ORDER_DATES.dt.hour

In [267]:
orderlist.head()

,ORDER_NBR,ORDER_LINE_NBR,CUSTOMER_NBR,PRODUCT_ID,ORDER_DATE,ORDER_TIME,ORDER_DATES,YEAR,MONTH,DAY,HOUR
0,3,1,627088,8228,2012-10-01,03:40:06,2012-10-01 03:40:06,2012,10,1,3
1,4,1,419748,61616,2012-10-01,07:32:14,2012-10-01 07:32:14,2012,10,1,7
2,16,1,250358,3265,2012-10-01,14:16:30,2012-10-01 14:16:30,2012,10,1,14
3,17,2,250358,3523,2012-10-01,14:16:30,2012-10-01 14:16:30,2012,10,1,14
4,24,1,381935,56148,2012-10-01,14:50:34,2012-10-01 14:50:34,2012,10,1,14

## Product

In [268]:
product = pd.read_csv('Data/Product master2.csv')

In [269]:
product.head()

,PRODUCT_ID,PACKING_SLIP_DESC,MERCH_DIV_DESC,BRAND_NAME
0,5643,A-D tarte Amazonian Clay Volumizing Mascara Duo,Health/Beauty,tarte
1,22506,"Dell All-in-One 20 Monitor Intel Dual Core""",Electronics,Dell
2,5321,"Dennis Basso 80 x 20"" Floral Lace Shawl""",Accessories,Dennis Basso
3,56183,Prepology 3-piece Magic Tong Set with Silicone,Home Decor,Prepology
4,10811,BareTraps Tall Shaft Boots w/ Ruching & Gore -,Accessories,BareTraps

In [270]:
air_product = pd.read_csv('Data/Product airtime.csv')

In [272]:
air_product['SEQ'] = np.arange(len(air_product))